---

C#Visual BasicVisual C++

Revit 2024 API
---
Visibility Enumeration
See Also Send Feedback
---

Describes the visibility of a particular geometry object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public enum Visibility

Visual Basic
---

    Public Enumeration Visibility

Visual C++
---

    public enum class Visibility

# Members

| Member name | Description |
| --- | --- |
| Visible | The geometry object is always visible. This type of geometry is always returned by [Geometry[([( Options])]) ](d8a55a5b-2a69-d5ab-3e1f-6cf1ee43c8ec.md) |
| Highlight | The geometry object is visible, but is affected by highlight or prehighlight special coloration. This type of geometry is returned by [Geometry[([( Options])]) ](d8a55a5b-2a69-d5ab-3e1f-6cf1ee43c8ec.md) if IncludeNonVisibleObjects is true. |
| Contextual | The geometry object is visible in some contexts, but not in others. This type of geometry is always returned by [Geometry[([( Options])]) ](d8a55a5b-2a69-d5ab-3e1f-6cf1ee43c8ec.md), even when Revit is in a context where the geometry should not be visible, but only if IncludeNonVisibleObjects is true. Examples of geometry of this class include Solids representing insulation and lining for MEP ducts and pipes. |
| Invisible | The geometry object is never visible. This type of geometry is never returned by [Geometry[([( Options])]) ](d8a55a5b-2a69-d5ab-3e1f-6cf1ee43c8ec.md) but may be obtained by other API operations. |

# See Also

Autodesk.Revit.DB Namespace